app/services/advisory_generator.rb

  def call
    result = GemmaClient.advise(prompt(build_snapshot))
    advisory = @order.advisories.create!(
      kind: "walk_away_risk",
      status: :pending,
      text: result["text"].to_s,
      rationale: result["rationale"].to_s,
      suggested_action: result["suggested_action"].to_s
    )
---
INSERT INTO "advisories" ("order_id", "kind", "text", "rationale", "suggested_action", "status", "created_at", "updated_at") VALUES ('82cd97c4-3496-4c51-9f08-ff8e6e275921', 'walk_away_risk', 'Please give an update to the customer at queue number 4 regarding their wait time.', 'The flagged order has waited significantly longer than the baseline preparation time.', 'Proactively communicate with the customer.', 0, '2026-07-04 10:35:17.991127', '2026-07-04 10:35:17.991127') RETURNING "id"