app/services/replayer.rb

DELETE FROM "orders"
SELECT COUNT(*) FROM "orders"
---
  def self.seed(anchor_minutes_ago: 12, now: Time.current)
    events = JSON.parse(File.read(FIXTURE))
    base = Time.parse(events.first["at"])
    shift = now - base - anchor_minutes_ago.minutes

    Advisory.delete_all # advisories FK-reference orders; clear them before resetting orders
    Order.delete_all
    ShopThreshold.delete_all # fresh demo: reset each shop's learned sensitivity to baseline
    by_qn = {}
    events.each do |e|
      at = Time.parse(e["at"]) + shift
      order = by_qn[e["queue_number"]] ||= Order.new(
        shop_id: e["shop_id"], queue_number: e["queue_number"], status: :waiting
      )
      case e["event"]
      when "joined"        then order.joined_at = at
      when "prepared"      then order.prepared_at = at
      when "customer_read" then order.customer_read_at = at
      when "completed"     then order.completed_at = at
      end
    end
    by_qn.values.select(&:joined_at).each do |o|
      o.status = o.materialized_status(now)
      o.save!
    end
    Order.live(now).count