app/views/advisories/_advisory.html.erb

  }[advisory.kind] || "Advisory"
  subject = advisory.order ? "order ##{advisory.order.queue_number}" : "whole kitchen"
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = '82cd97c4-3496-4c51-9f08-ff8e6e275921' LIMIT 1