app/views/console/index.html.erb

SELECT "advisories".* FROM "advisories" ORDER BY "advisories"."created_at" DESC LIMIT 20
---
  <div id="advisories" class="space-y-3" data-controller="chime">
    <%= render Advisory.recent.limit(20) %>